{
    "Title": "Construction of VOP near Sadahalli Gate at Km.538.832 of Ministry identified blackspot KA01 016BS for Hyderabad",
    "Reference Number": "12/NHAI/RO-BNG/Roa",
    "Organization Name": "Name Vilas P Brahmankar",
    "Bid Submission Start Date": "2025-07-05",
    "Bid Submission End Date": "2025-08-19",
    "Bid Opening Date": "2025-08-20",
    "Description": "Government eProcurement System Tender Details Date : 06-Jul-2025 01:23 PM Print Basic Details Organisation Chain National Highways Authority of India||RO-Bangalore - NHAI Tender Reference Number 12/NHAI/RO-BNG/Road Safety/Tender/2025-26 dt.05.07.2025 Tender ID 2025_NHAI_240410_1 Withdrawal Allowed Yes Tender Type Open Tender Form of contract EPC Contract Tender Category Works No. of Covers 2 General Technical ItemWise Technical Evaluation No No Evaluation Allowed Allowed Payment Mode Offline Is Multi Currency Allowed For BOQ No Is Multi Currency Allowed No Allow Two Stage Bidding No For Fee Payment Instruments Cover Details, No. Of Covers - 2 Offline S.No Instrument Type Cover No Cover Document Type Description 1 Demand Draft Scan copy of 2 FDR 1 Fee/PreQual/Technical .pdf tender document fee 3 Bank Guarantee Scan copy of 4 NEFT .pdf Bid security 5 R-T-G-S (as per RFP) 6 Insurance Surety Bond Scan copy of .pdf PoA. Technical .rar documents. Financial 2 Finance .xls Proposal Letter comprising of .pdf Financial Proposal. Tender Fee Details, [Total Fee in ₹ * - 10,000] EMD Fee Details Tender Fee in ₹ 10,000 EMD Amount in ₹ 27,17,000 EMD Exemption No Allowed Fee Payable To NHAI-RO Fee Payable At Bangalore EMD Fee Type fixed EMD Percentage NA Tender Fee Exemption No Allowed EMD Payable To NHAI-RO EMD Payable At Bangalore Work /Item(s) Title Construction of VOP near Sadahalli Gate at Km.538.832 of Ministry identified blackspot KA01 016BS for Hyderabad Bengaluru Section of NH7 from Km. 534.720 to Km. 556.840 in the State of Karnataka on EPC mode Work Description Construction of VOP near Sadahalli Gate at Km.538.832 of Ministry identified blackspot KA01 016BS for Hyderabad Bengaluru Section of NH7 from Km. 534.720 to Km. 556.840 in the State of Karnataka on EPC mode Pre Qualification Details Please refer Tender documents. Independent External NA Monitor/Remarks Tender Value in ₹ 27,17,00,000 Product Category Civil Works - Sub category NA Highways Contract Type Tender Bid Validity(Days) 120 Period Of Work(Days) 365 Location NHAI-RO- Pincode 560073 Pre Bid Meeting Place NA Bangalore Pre Bid Meeting Address NA Pre Bid Meeting Date NA Bid Opening Place NHAI-RO- Bangalore Should Allow NDA Tender No Allow Preferential Bidder No Critical Dates Publish Date 05-Jul-2025 05:00 PM Bid Opening Date 20-Aug-2025 11:30 AM Document Download / Sale Start Date 05-Jul-2025 05:00 PM Document Download / Sale End Date 19-Aug-2025 11:00 AM Clarification Start Date NA Clarification End Date NA Bid Submission Start Date 05-Jul-2025 05:00 PM Bid Submission End Date 19-Aug-2025 11:00 AM Tender Documents NIT Document Document Size S.No Document Name Description (in KB) 1 Tendernotice_1.pdf Notice Inviting Bid 117.82 Work Item Document Size Documents S.No Document Type Document Name Description (in KB) 1 Tender Documents NIT12.pdf Tender documents 101.78 Tender Inviting Authority Name Vilas P Brahmankar Address NHAI-RO-Bangalore",
    "Short Summary": "National Highways Authority of India's Road Safety/Tender/2025-26 dt.05.07.05 Jul.2025 . Withdrawal Allowed Yes; Multi Currency Allowed for BOQ No; Two Stage Bidding No.  Construction of VOP near Sadahalli Gate at Km.538.832 of Ministry identified blackspot KA01 016BS for Hyderabad . Bengaluru Section of NH7 from . 534.720 to . 556.840 in the State of Karnataka on EPC mode ."
}